Revit 2026 API

# FieldDomainPointsByXYZ Constructor

---

Initializes a new instance of the FieldDomainPointsByXYZ class

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FieldDomainPointsByXYZ(
	IList<XYZ> points
)
```
```vb
Public Sub New (
	points As IList(Of XYZ)
)
```
```cpp
public:
FieldDomainPointsByXYZ(
	IList<XYZ^>^ points
)
```
```fsharp
new :
        points : IList<XYZ> -> FieldDomainPointsByXYZ
```

#### Parameters

points IListXYZ

#### Reference

FieldDomainPointsByXYZ Class

Autodesk.Revit.DB.Analysis Namespace